# SegmentLengthDimensionsOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..SegmentLengthDimensionsOffset Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies the offset of the segment length dimensions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double SegmentLengthDimensionsOffset { get; set; }
```

Visual Basic
---
```text
Public Property SegmentLengthDimensionsOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SegmentLengthDimensionsOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for segmentLengthDimensionsOffset must be between 0 and 30000 feet. |

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace